source/_posts/2018-04-11-java-web.html
---
title: "java-web"
date: 2018-04-11
layout: post
categories: 
- javaWeb
tags: 
- java
published: true
comments: 
---

<div id="outline-container-orgf321db9" class="outline-2">
<h2 id="orgf321db9"><span class="section-number-2">1</span> JavaEE 三层结构</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>web层 视图层 struct2框架</li>
<li>service层 业务逻辑层 spring框架</li>
<li>dao层 hibernate框架 对数据库进行crud操作（增删改查）</li>
</ol>
</div>
<div id="outline-container-org169513c" class="outline-3">
<h3 id="org169513c"><span class="section-number-3">1.1</span> MVC分层思想</h3>
</div>
</div>
<div id="outline-container-orgcb0a948" class="outline-2">
<h2 id="orgcb0a948"><span class="section-number-2">2</span> hibernate框架</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>对jdbc进行封装</li>
<li>开源轻量级框架</li>
<li>应用在javaEE的dao层</li>
</ol>
</div>
<div id="outline-container-org3369524" class="outline-3">
<h3 id="org3369524"><span class="section-number-3">2.1</span> ORM思想</h3>
<div class="outline-text-3" id="text-2-1">
<p>
即对象关系映射
</p>
<ol class="org-ol">
<li>让实体类（javabean的别名）和数据库进行一一对应：实体类和数据库表对应；实体类属性
和表里字段对应</li>
<li>不需要直接操作数据库表，而操作表对应实体类对象</li>
</ol>
</div>
</div>
<div id="outline-container-org1f643b7" class="outline-3">
<h3 id="org1f643b7"><span class="section-number-3">2.2</span> 搭建hibernate环境</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>导入hibernate框架jar包，以及日志输出和数据库驱动jar包</li>
<li>创建实体类（实体类必须包含一个唯一属性）</li>
<li>配置实体类和数据库表一一对应关系（映射）</li>
<li>创建hibernate核心配置文件</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org52ebd43" class="outline-2">
<h2 id="org52ebd43"><span class="section-number-2">3</span> spring框架</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>开源轻量级框架</li>
<li>一站式框架</li>
</ol>
</div>
<div id="outline-container-org590fbca" class="outline-3">
<h3 id="org590fbca"><span class="section-number-3">3.1</span> 核心部分</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org53e529e" class="outline-4">
<h4 id="org53e529e"><span class="section-number-4">3.1.1</span> IOC 控制反转</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
两种方式：配置文件方式和注解方式
</p>

<p>
<b>底层原理使用技术</b>
</p>
<ol class="org-ol">
<li>xml配置文件</li>
<li>dom4j解析xml</li>
<li>工厂设计模式</li>
<li>反射</li>
</ol>
</div>
</div>
<div id="outline-container-orgb00f42f" class="outline-4">
<h4 id="orgb00f42f"><span class="section-number-4">3.1.2</span> AOP 面向切面编程</h4>
</div>
</div>
<div id="outline-container-org8fd17cb" class="outline-3">
<h3 id="org8fd17cb"><span class="section-number-3">3.2</span> 一站式框架</h3>
<div class="outline-text-3" id="text-3-2">
<p>
spring针对javaee三层结构分别提供不同解决方案
</p>
<ul class="org-ul">
<li>web层 springMVC</li>
<li>service层 spring的IOC</li>
<li>dao层 spring的jdbcTemplate</li>
</ul>
</div>
</div>
</div>
